#!/usr/bin/python3
# -*- coding: utf-8 -*-
# @Author: Hui
# @Desc: { 算术运算符 IPython测验 }
# @Date: 2021/06/05 22:28

# 加减算术运算符测验
"""
In [15]: # 加法运算

In [16]: a = 3

In [17]: b = 6

In [18]: c = a + b

In [19]: c
Out[19]: 9

In [20]: a + b
Out[20]: 9

In [21]: # 减法运算

In [22]: a = 10

In [23]: b = 5

In [24]: a - b
Out[24]: 5
"""


# 乘除算术运算符测验
"""
In [25]: # 乘法运算

In [26]: a = 10

In [27]: b = 20

In [28]: a * b
Out[28]: 200

In [29]: 10 * 20
Out[29]: 200
    
In [30]: # 除法运算

In [31]: 10 / 20
Out[31]: 0.5

In [32]: # 取整除

In [33]: 10 / 3  # 普通除
Out[33]: 3.3333333333333335

In [34]: 10 //3  # 整除
Out[34]: 3    
"""


# 取余、幂算术运算符测验
"""
In [35]: # 取余数

In [36]: 10 % 3
Out[36]: 1

In [37]: # 幂运算

In [38]: 2 ** 3
Out[38]: 8

In [39]: 2 ** 10
Out[39]: 1024
"""
